package com.kh.variableEx;
/*
매개변수
	중간에 개입해서 변경하는 수
	주로 메서드에서 메서드이름 옆에 만들어지는 (      ) 안에 작성
	
	메서드
		public 메서드이름(매개변수) {
			중간에 개입해서 변하는 수를 이용해서 새로운 결과를 보여줌
		}

지역변수
	지역에서만 사용되는 변수
	특정 지역은 {   } 사용
	{   } 안에서 작성한 변수는 괄호를 나가게 되면 사용하지 못하게 됨
	
	ex) { String 지역사람 = "오항도";
		}
		오항도는 {   } 안에서는 누구나 아는 지역 사람이지만
		{   }를 나가는 순간부터 오항도가 누구여..? 라는 빨간 줄이 생김
	
전역변수
	클래스이름 밑에서부터 클래스 안에서는 어디서든 사용 가능한 변수
	
	ex)
		public class 자바 {
		//필드 = 전역변수
			자료형 {   } 안에 있는 공간에서 어느 곳에서든 사용할 수 있는 전국 지역에서 유명한 변수;
		}
*/
public class 심화변수 {

}
